{
    "format": "graph-model",
    "generatedBy": "2.11.0",
    "convertedBy": "TensorFlow.js Converter v3.19.0",
    "signature": {
      "inputs": {
        "input_2": {
          "name": "input_2:0",
          "dtype": "DT_FLOAT",
          "tensorShape": {
            "dim": [
              {
                "size": "-1"
              },
              {
                "size": "32"
              },
              {
                "size": "32"
              },
              {
                "size": "3"
              }
            ]
          }
        }
      },
      "outputs": {
        "dense_3": {
          "name": "Identity:0",
          "dtype": "DT_FLOAT",
          "tensorShape": {
            "dim": [
              {
                "size": "-1"
              },
              {
                "size": "28"
              }
            ]
          }
        }
      }
    },
    "modelTopology": {
      "node": [
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Const",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/axes",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/GatherV2_1/axis",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Const_1",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Reshape_1",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/free",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/GatherV2/axis",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Const_2",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {}
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/concat_1/axis",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/ExpandDims/dim",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_5/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "5"
                    },
                    {
                      "size": "5"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_5/BiasAdd/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_6/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "5"
                    },
                    {
                      "size": "5"
                    },
                    {
                      "size": "64"
                    },
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_6/BiasAdd/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_7/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "64"
                    },
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_7/BiasAdd/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_8/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "64"
                    },
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_8/BiasAdd/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_9/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "64"
                    },
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_9/BiasAdd/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/flatten_1/Const",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "2"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "4096"
                    },
                    {
                      "size": "256"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "256"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_11/batchnorm/mul",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "256"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_11/batchnorm/sub",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "256"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/dense_3/MatMul/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "256"
                    },
                    {
                      "size": "28"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/dense_3/BiasAdd/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "28"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "input_2",
          "op": "Placeholder",
          "attr": {
            "shape": {
              "shape": {
                "dim": [
                  {
                    "size": "-1"
                  },
                  {
                    "size": "32"
                  },
                  {
                    "size": "32"
                  },
                  {
                    "size": "3"
                  }
                ]
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/Scaled",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/Offset",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/Scaled",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/Offset",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_10/FusedBatchNormV3/Scaled",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_10/FusedBatchNormV3/Offset",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_9/FusedBatchNormV3/Scaled",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_9/FusedBatchNormV3/Offset",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_8/FusedBatchNormV3/Scaled",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_8/FusedBatchNormV3/Offset",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "64"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Shape",
          "op": "Shape",
          "input": [
            "input_2"
          ],
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            },
            "out_type": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/GatherV2_1",
          "op": "GatherV2",
          "input": [
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Shape",
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/axes",
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/GatherV2_1/axis"
          ],
          "attr": {
            "Tparams": {
              "type": "DT_INT32"
            },
            "Taxis": {
              "type": "DT_INT32"
            },
            "Tindices": {
              "type": "DT_INT32"
            },
            "batch_dims": {
              "i": "0"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/GatherV2",
          "op": "GatherV2",
          "input": [
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Shape",
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/free",
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/GatherV2/axis"
          ],
          "attr": {
            "Tindices": {
              "type": "DT_INT32"
            },
            "batch_dims": {
              "i": "0"
            },
            "Tparams": {
              "type": "DT_INT32"
            },
            "Taxis": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Prod_1",
          "op": "Prod",
          "input": [
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/GatherV2_1",
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Const_1"
          ],
          "attr": {
            "keep_dims": {
              "b": false
            },
            "T": {
              "type": "DT_INT32"
            },
            "Tidx": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Prod",
          "op": "Prod",
          "input": [
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/GatherV2",
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Const"
          ],
          "attr": {
            "Tidx": {
              "type": "DT_INT32"
            },
            "keep_dims": {
              "b": false
            },
            "T": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/concat_1",
          "op": "ConcatV2",
          "input": [
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/GatherV2",
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Const_2",
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/concat_1/axis"
          ],
          "attr": {
            "T": {
              "type": "DT_INT32"
            },
            "N": {
              "i": "2"
            },
            "Tidx": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/stack",
          "op": "Pack",
          "input": [
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Prod",
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Prod_1"
          ],
          "attr": {
            "N": {
              "i": "2"
            },
            "axis": {
              "i": "0"
            },
            "T": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Reshape",
          "op": "Reshape",
          "input": [
            "input_2",
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/stack"
          ],
          "attr": {
            "Tshape": {
              "type": "DT_INT32"
            },
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/MatMul",
          "op": "MatMul",
          "input": [
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Reshape",
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Reshape_1"
          ],
          "device": "/device:CPU:0",
          "attr": {
            "transpose_a": {
              "b": false
            },
            "transpose_b": {
              "b": false
            },
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot",
          "op": "Reshape",
          "input": [
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/MatMul",
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/concat_1"
          ],
          "attr": {
            "Tshape": {
              "type": "DT_INT32"
            },
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/ExpandDims",
          "op": "ExpandDims",
          "input": [
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot",
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/ExpandDims/dim"
          ],
          "attr": {
            "Tdim": {
              "type": "DT_INT32"
            },
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_5/Relu",
          "op": "_FusedConv2D",
          "input": [
            "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/ExpandDims",
            "StatefulPartitionedCall/sequential_1/conv2d_5/Conv2D/ReadVariableOp",
            "StatefulPartitionedCall/sequential_1/conv2d_5/BiasAdd/ReadVariableOp"
          ],
          "device": "/device:CPU:0",
          "attr": {
            "data_format": {
              "s": "TkhXQw=="
            },
            "strides": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            },
            "explicit_paddings": {
              "list": {}
            },
            "T": {
              "type": "DT_FLOAT"
            },
            "fused_ops": {
              "list": {
                "s": [
                  "Qmlhc0FkZA==",
                  "UmVsdQ=="
                ]
              }
            },
            "padding": {
              "s": "U0FNRQ=="
            },
            "num_args": {
              "i": "1"
            },
            "use_cudnn_on_gpu": {
              "b": true
            },
            "epsilon": {
              "f": 0
            },
            "dilations": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/Mul",
          "op": "Mul",
          "input": [
            "StatefulPartitionedCall/sequential_1/conv2d_5/Relu",
            "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/Scaled"
          ],
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3",
          "op": "Add",
          "input": [
            "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/Mul",
            "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/Offset"
          ],
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_6/Relu",
          "op": "_FusedConv2D",
          "input": [
            "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3",
            "StatefulPartitionedCall/sequential_1/conv2d_6/Conv2D/ReadVariableOp",
            "StatefulPartitionedCall/sequential_1/conv2d_6/BiasAdd/ReadVariableOp"
          ],
          "device": "/device:CPU:0",
          "attr": {
            "strides": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            },
            "explicit_paddings": {
              "list": {}
            },
            "data_format": {
              "s": "TkhXQw=="
            },
            "padding": {
              "s": "U0FNRQ=="
            },
            "T": {
              "type": "DT_FLOAT"
            },
            "num_args": {
              "i": "1"
            },
            "fused_ops": {
              "list": {
                "s": [
                  "Qmlhc0FkZA==",
                  "UmVsdQ=="
                ]
              }
            },
            "epsilon": {
              "f": 0
            },
            "use_cudnn_on_gpu": {
              "b": true
            },
            "dilations": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/Mul",
          "op": "Mul",
          "input": [
            "StatefulPartitionedCall/sequential_1/conv2d_6/Relu",
            "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/Scaled"
          ],
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3",
          "op": "Add",
          "input": [
            "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/Mul",
            "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/Offset"
          ],
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/max_pooling2d_2/MaxPool",
          "op": "MaxPool",
          "input": [
            "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3"
          ],
          "attr": {
            "data_format": {
              "s": "TkhXQw=="
            },
            "strides": {
              "list": {
                "i": [
                  "1",
                  "2",
                  "2",
                  "1"
                ]
              }
            },
            "explicit_paddings": {
              "list": {}
            },
            "padding": {
              "s": "VkFMSUQ="
            },
            "T": {
              "type": "DT_FLOAT"
            },
            "ksize": {
              "list": {
                "i": [
                  "1",
                  "2",
                  "2",
                  "1"
                ]
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_7/Relu",
          "op": "_FusedConv2D",
          "input": [
            "StatefulPartitionedCall/sequential_1/max_pooling2d_2/MaxPool",
            "StatefulPartitionedCall/sequential_1/conv2d_7/Conv2D/ReadVariableOp",
            "StatefulPartitionedCall/sequential_1/conv2d_7/BiasAdd/ReadVariableOp"
          ],
          "device": "/device:CPU:0",
          "attr": {
            "use_cudnn_on_gpu": {
              "b": true
            },
            "T": {
              "type": "DT_FLOAT"
            },
            "dilations": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            },
            "padding": {
              "s": "U0FNRQ=="
            },
            "strides": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            },
            "explicit_paddings": {
              "list": {}
            },
            "fused_ops": {
              "list": {
                "s": [
                  "Qmlhc0FkZA==",
                  "UmVsdQ=="
                ]
              }
            },
            "data_format": {
              "s": "TkhXQw=="
            },
            "epsilon": {
              "f": 0
            },
            "num_args": {
              "i": "1"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_8/FusedBatchNormV3/Mul",
          "op": "Mul",
          "input": [
            "StatefulPartitionedCall/sequential_1/conv2d_7/Relu",
            "StatefulPartitionedCall/sequential_1/batch_normalization_8/FusedBatchNormV3/Scaled"
          ],
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_8/FusedBatchNormV3",
          "op": "Add",
          "input": [
            "StatefulPartitionedCall/sequential_1/batch_normalization_8/FusedBatchNormV3/Mul",
            "StatefulPartitionedCall/sequential_1/batch_normalization_8/FusedBatchNormV3/Offset"
          ],
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_8/Relu",
          "op": "_FusedConv2D",
          "input": [
            "StatefulPartitionedCall/sequential_1/batch_normalization_8/FusedBatchNormV3",
            "StatefulPartitionedCall/sequential_1/conv2d_8/Conv2D/ReadVariableOp",
            "StatefulPartitionedCall/sequential_1/conv2d_8/BiasAdd/ReadVariableOp"
          ],
          "device": "/device:CPU:0",
          "attr": {
            "strides": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            },
            "padding": {
              "s": "U0FNRQ=="
            },
            "num_args": {
              "i": "1"
            },
            "T": {
              "type": "DT_FLOAT"
            },
            "use_cudnn_on_gpu": {
              "b": true
            },
            "dilations": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            },
            "data_format": {
              "s": "TkhXQw=="
            },
            "explicit_paddings": {
              "list": {}
            },
            "epsilon": {
              "f": 0
            },
            "fused_ops": {
              "list": {
                "s": [
                  "Qmlhc0FkZA==",
                  "UmVsdQ=="
                ]
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_9/FusedBatchNormV3/Mul",
          "op": "Mul",
          "input": [
            "StatefulPartitionedCall/sequential_1/conv2d_8/Relu",
            "StatefulPartitionedCall/sequential_1/batch_normalization_9/FusedBatchNormV3/Scaled"
          ],
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_9/FusedBatchNormV3",
          "op": "Add",
          "input": [
            "StatefulPartitionedCall/sequential_1/batch_normalization_9/FusedBatchNormV3/Mul",
            "StatefulPartitionedCall/sequential_1/batch_normalization_9/FusedBatchNormV3/Offset"
          ],
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/max_pooling2d_3/MaxPool",
          "op": "MaxPool",
          "input": [
            "StatefulPartitionedCall/sequential_1/batch_normalization_9/FusedBatchNormV3"
          ],
          "attr": {
            "data_format": {
              "s": "TkhXQw=="
            },
            "explicit_paddings": {
              "list": {}
            },
            "strides": {
              "list": {
                "i": [
                  "1",
                  "2",
                  "2",
                  "1"
                ]
              }
            },
            "padding": {
              "s": "VkFMSUQ="
            },
            "T": {
              "type": "DT_FLOAT"
            },
            "ksize": {
              "list": {
                "i": [
                  "1",
                  "2",
                  "2",
                  "1"
                ]
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_9/Relu",
          "op": "_FusedConv2D",
          "input": [
            "StatefulPartitionedCall/sequential_1/max_pooling2d_3/MaxPool",
            "StatefulPartitionedCall/sequential_1/conv2d_9/Conv2D/ReadVariableOp",
            "StatefulPartitionedCall/sequential_1/conv2d_9/BiasAdd/ReadVariableOp"
          ],
          "device": "/device:CPU:0",
          "attr": {
            "strides": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            },
            "explicit_paddings": {
              "list": {}
            },
            "epsilon": {
              "f": 0
            },
            "num_args": {
              "i": "1"
            },
            "use_cudnn_on_gpu": {
              "b": true
            },
            "dilations": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            },
            "padding": {
              "s": "U0FNRQ=="
            },
            "T": {
              "type": "DT_FLOAT"
            },
            "fused_ops": {
              "list": {
                "s": [
                  "Qmlhc0FkZA==",
                  "UmVsdQ=="
                ]
              }
            },
            "data_format": {
              "s": "TkhXQw=="
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_10/FusedBatchNormV3/Mul",
          "op": "Mul",
          "input": [
            "StatefulPartitionedCall/sequential_1/conv2d_9/Relu",
            "StatefulPartitionedCall/sequential_1/batch_normalization_10/FusedBatchNormV3/Scaled"
          ],
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_10/FusedBatchNormV3",
          "op": "Add",
          "input": [
            "StatefulPartitionedCall/sequential_1/batch_normalization_10/FusedBatchNormV3/Mul",
            "StatefulPartitionedCall/sequential_1/batch_normalization_10/FusedBatchNormV3/Offset"
          ],
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape",
          "op": "Reshape",
          "input": [
            "StatefulPartitionedCall/sequential_1/batch_normalization_10/FusedBatchNormV3",
            "StatefulPartitionedCall/sequential_1/flatten_1/Const"
          ],
          "attr": {
            "Tshape": {
              "type": "DT_INT32"
            },
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/dense_2/Relu",
          "op": "_FusedMatMul",
          "input": [
            "StatefulPartitionedCall/sequential_1/flatten_1/Reshape",
            "StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp",
            "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/ReadVariableOp"
          ],
          "device": "/device:CPU:0",
          "attr": {
            "fused_ops": {
              "list": {
                "s": [
                  "Qmlhc0FkZA==",
                  "UmVsdQ=="
                ]
              }
            },
            "num_args": {
              "i": "1"
            },
            "transpose_a": {
              "b": false
            },
            "transpose_b": {
              "b": false
            },
            "T": {
              "type": "DT_FLOAT"
            },
            "epsilon": {
              "f": 0
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_11/batchnorm/mul_1",
          "op": "Mul",
          "input": [
            "StatefulPartitionedCall/sequential_1/dense_2/Relu",
            "StatefulPartitionedCall/sequential_1/batch_normalization_11/batchnorm/mul"
          ],
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/batch_normalization_11/batchnorm/add_1",
          "op": "AddV2",
          "input": [
            "StatefulPartitionedCall/sequential_1/batch_normalization_11/batchnorm/mul_1",
            "StatefulPartitionedCall/sequential_1/batch_normalization_11/batchnorm/sub"
          ],
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/dense_3/BiasAdd",
          "op": "_FusedMatMul",
          "input": [
            "StatefulPartitionedCall/sequential_1/batch_normalization_11/batchnorm/add_1",
            "StatefulPartitionedCall/sequential_1/dense_3/MatMul/ReadVariableOp",
            "StatefulPartitionedCall/sequential_1/dense_3/BiasAdd/ReadVariableOp"
          ],
          "device": "/device:CPU:0",
          "attr": {
            "num_args": {
              "i": "1"
            },
            "transpose_a": {
              "b": false
            },
            "T": {
              "type": "DT_FLOAT"
            },
            "fused_ops": {
              "list": {
                "s": [
                  "Qmlhc0FkZA=="
                ]
              }
            },
            "transpose_b": {
              "b": false
            },
            "epsilon": {
              "f": 0
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/dense_3/Softmax",
          "op": "Softmax",
          "input": [
            "StatefulPartitionedCall/sequential_1/dense_3/BiasAdd"
          ],
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "Identity",
          "op": "Identity",
          "input": [
            "StatefulPartitionedCall/sequential_1/dense_3/Softmax"
          ],
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            }
          }
        }
      ],
      "library": {},
      "versions": {
        "producer": 1087
      }
    },
    "weightsManifest": [
      {
        "paths": [
          "group1-shard1of2.bin",
          "group1-shard2of2.bin"
        ],
        "weights": [
          {
            "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Const",
            "shape": [
              1
            ],
            "dtype": "int32"
          },
          {
            "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/axes",
            "shape": [
              1
            ],
            "dtype": "int32"
          },
          {
            "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/GatherV2_1/axis",
            "shape": [],
            "dtype": "int32"
          },
          {
            "name": "StatefulPartitionedCall/sequential_1/lambda_1/rgb_to_grayscale/Tensordot/Const_1",
            "shape": [
              1
